package sensetime

var livenessStatusMap = map[string]string{
	"ok":               "成功！",
	"hack":             "假造人脸(比如视频拍摄的是照片)",
	"short_time":       "视频时长不足2s",
	"no_face_detected": "视频中未检测到人脸",
	"loss_tracking":    "人脸中途出框",
	"face_changed":     "视频中途人脸被替换",
	"face_occlusion":   "人脸一定时间内遮挡",
}
var codeMap = map[string]string{
	"1000": "成功",
	"1100": "账号密码不匹配或签名认证生成有误",
	"1200": "输入参数无效",
	"1101": "账号过期",
	"1103": "该接口没有权限",
	"1002": "调频率超过限制",
	"2003": "图片尺寸不符合要求",
	"2004": "图片体积不符合要求",
	"2005": "图片类型不符合要求",
	"2006": "图片损坏",
	"2007": "活体数据损坏",
	"2008": "无效的视频文件",
	"3000": "外部服务不可用",
	"3001": "外部服务超时",
	"3002": "外部服务出错",
	"3003": "姓名与身份证号不匹配",
	"3004": "身份证号无效",
	"3005": "第三方底图不存在",
	"4000": "提取特征失败,没有检测到图片中的人脸",
	"4001": "身份证服务检测失败",
	"4007": "静默活体检测失败",
}
